# RbsElecAnalyticalLoadsInSet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecAnalyticalLoadsInSet Property
ParameterTypeId Class See Also
---
"Loads in Set"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecAnalyticalLoadsInSet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecAnalyticalLoadsInSet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecAnalyticalLoadsInSet {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace